Knusper.org
#+TITLE: ECH's Emacs configuration
#+OPTIONS: toc:4 h:4 creator:t 
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="zenburn-code.css" />

* Notes

- Somewhat inspired by [[http://sach.ac/dotemacs][Sacha Chua's Emacs configuration]]. 

* Init file
** Init file - code and notes
   We still need an [[http://www.emacswiki.org/emacs/InitFile][Init File]] (=~/.emacs.d/init.el= or =~/.emacs=)
   that loads =org-mode=, sets up the paths for packages that we don't
   install via the package manager.

   Before starting emacs with this init file, we install org-mode and
   AuCTeX on the system where this ~.emacs~ is delployed.

   When ~org-mode~ is installed, we can open this file and run ~C-c
   C-v C~t~ to tangle this file.

   To tangle the file from the command line:
   #+BEGIN_SRC sh
   emacs --batch -l org Knusper.org -f org-babel-tangle
   #+END_SRC
   
   ~.emacs~ or ~.emacs.d/init.el~
   #+BEGIN_SRC emacs-lisp :tangle no
     ;; ~/.emacs.d/init.el (or ~/.emacs)

     ;; This sets up the load path so that we can override it
     (package-initialize nil)
     (add-to-list 'load-path (expand-file-name "~/emacs-scripts/"))

     ;; org-mode
     (add-to-list 'load-path (expand-file-name "~/emacs-scripts/org-9.2/lisp/"))
     (add-to-list 'load-path "~/emacs-scripts/org-9.2/contrib/lisp" t)
     (eval-after-load "info"
       '(progn
	  (info-initialize)
	  (add-to-list 'Info-directory-list "~/emacs-scripts/org-9.2/doc/")))
     (require 'org-tempo) ;; old-school structure templates

     ;; auctex
     (add-to-list 'load-path (expand-file-name "~/.emacs.d/site-lisp/auctex"))
     (load "auctex.el" nil t t)
     (load "preview-latex.el" nil t t)

     ;; Load the rest of the packages
     (package-initialize nil)
     (setq package-enable-at-startup nil)

     ;; rather than using org-babel-load file I tangle this file (C-c C-v C-t)
     ;; and load it directly
     ;; (load-file "~/Org/dotemacs_project/Knusper.el")  ;; uncomment this line, after this file has been tangled
   #+END_SRC
  
** Notes on org-mode installation

   - Just run ~make~
   - Version currently installed: 9.2

** Notes on AucTeX installation
    
   - Download AucTeX from [[https://www.gnu.org/software/auctex/download-for-unix.html]]
   - Compile using ~./configure --prefix=$HOME/.emacs.d/site-lisp/auctex --with-lispdir=$HOME/.emacs.d/site-lisp/auctex --without-texmf-dir~
   - Version currently installed: 11.89

** General

*** Start the emacs server
    #+BEGIN_SRC emacs-lisp :tangle yes
    (server-start)
    #+END_SRC

*** Load Custom File
    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq custom-file "~/.gnu-emacs-custom")
      (load custom-file)
    #+END_SRC

* Personal Information

  #+BEGIN_SRC emacs-lisp :tangle yes
    (setq user-full-name "Edmund Christian Herenz")
  #+END_SRC

* Mode-specific settings
** Notes
   I install AucTeX + org-mode manually, as these are the modes that I
   depend on most for my work.  For this reason I want full control
   over the installation process.

   See also: [[*Notes on org-mode installation][Notes on org-mode installation]] and [[*Notes on AucTeX installation][Notes on AucTeX installation]]
   
** LateX
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq TeX-auto-save t)
     (setq TeX-parse-self t)
     (setq-default TeX-master nil)
     (setq LaTeX-math-menu-unicode t)
     (add-hook 'LaTeX-mode-hook 'turn-on-auto-fill)
     (require 'reftex)
     (add-hook 'LaTeX-mode-hook 'turn-on-reftex)
     (setq reftex-plug-into-AUCTeX t)
     (setq reftex-cite-format 'natbib)

     ;; use mupdf as default PDF viewer
     (with-eval-after-load "tex"
       (add-to-list 'TeX-view-program-list '("mupdf" "/usr/bin/mupdf %o"))
       (setcdr (assq 'output-pdf TeX-view-program-selection) '("mupdf")))
   #+END_SRC

** Org-Mode

   org-mode is installed manually ([[*Init file - code and notes][see above]]).  Load org-mode:
   #+BEGIN_SRC emacs-lisp :tangle yes
     (require 'org)  
   #+END_SRC

   Open org-mode files in org-mode:
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq auto-mode-alist
	   (cons '("\\.org$" . org-mode) auto-mode-alist))
   #+END_SRC
   Store time when a task is done
   #+begin_src emacs-lisp :tangle yes
     (setq org-log-done t)
   #+end_src

    Latex font-highlight in org-mode
    #+BEGIN_SRC emacs-lisp :tangle yes
      (eval-after-load 'org '(setf org-highlight-latex-and-related
	'(latex)))
    #+END_SRC

   Since 9.2 we also need to load org-tempo to have quick acces to
   [[https://orgmode.org/manual/Structure-Templates.html]["structure templates"]]:
   #+begin_src emacs-lisp :tangle yes
     (require 'org-tempo)
   #+end_src

*** Key bindings 

   Reasonable "default" key bindings:
   #+BEGIN_SRC emacs-lisp :tangle yes
     (global-set-key "\C-cl" 'org-store-link)
     (global-set-key "\C-ca" 'org-agenda)
     ;; (global-set-key "\C-cb" 'org-iswitchb)
     (global-set-key (kbd "C-c c") 'org-capture)
   #+END_SRC

   org-mode defines some key bindings, that override some of my
   personal global key-bindings - these key bindings are disabled here:
   #+BEGIN_SRC emacs-lisp :tangle yes
     (eval-after-load 'org
     (progn
	  ;; these are my windmove key-bindings
	  (define-key org-mode-map (kbd "<C-S-right>") nil)
	  (define-key org-mode-map (kbd "<C-S-left>") nil)
	  (define-key org-mode-map (kbd "<C-S-up>") nil)
	  (define-key org-mode-map (kbd "<C-S-down>") nil)
	  ))
    #+END_SRC

*** Capture Templates
    
    The capture template for bookmarks requires org-cliplink to be installed

    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq org-capture-templates
	    '(
	      ("b" "Bookmark" entry (file+headline "~/Org/bookmarks.org" "Bookmarks")
	       "* %(org-cliplink-capture) %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines 1)
	      )
	    )
    #+end_src

*** Open png image files with default image viewer on system

    #+BEGIN_SRC emacs-lisp :tangle yes
      (add-hook 'org-mode-hook
      '(lambda ()
	     (setq org-file-apps
		   (append '(
			     ("\\.png\\'" . default)
			     ) org-file-apps ))))
    #+END_SRC
*** Set width to inline images

   The following setting enables inline images to be scaled when
   displayed inline (~org-toggle-inline-images~):
   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq org-image-actual-width nil)
   #+END_SRC

   Now, put this before an image link to scale it
   ~#+ATTR_ORG: :width 500px~

*** "Ugly" Hack to disable PDFs in links to open in DocView Mode

    This is from http://emacs.stackexchange.com/a/24580/5254 No idea
    why it is so complicated, to have linked PDF files popping up in
    an external viewer (btw., I use [[http://www.mupdf.com/][mupdf]])

    #+BEGIN_SRC emacs-lisp :tangle yes
      (defun ensc/mailcap-mime-data-filter (filter)
        ""
        (mapcar (lambda(major)
              (append (list (car major))
                  (remove nil
                      (mapcar (lambda(minor)
      		      (when (funcall filter (car major) (car minor) (cdr minor))
                          minor))
                          (cdr major)))))
      mailcap-mime-data))

      (defun ensc/no-pdf-doc-view-filter (major minor spec)
        (if (and (string= major "application")
       (string= minor "pdf")
       (member '(viewer . doc-view-mode) spec))
      nil
          t))

      (eval-after-load 'mailcap
        '(progn
           (setq mailcap-mime-data
       (ensc/mailcap-mime-data-filter 'ensc/no-pdf-doc-view-filter))))
    #+END_SRC

*** org-agenda-category-icon-alist
     
    Icons in this list visually "pimp-up" the org-mode agenda.  We
    use the symbols provided by the [[*all the icons][all-the-icons package]], which is
    installed further below.

    #+BEGIN_SRC emacs-lisp :tangle yes
      (eval-after-load 'all-the-icons
      '(setq org-agenda-category-icon-alist 
	    `(
	      ("talk"
	       ,(list
		 (all-the-icons-faicon "graduation-cap"  :face 'all-the-icons-red))
	       nil nil :ascent center)
	      ("flight"
	       ,(list
		 (all-the-icons-alltheicon "swift"  :face 'all-the-icons-blue))
	       nil nil :ascent center)
	      ("mail"
	       ,(list
		 (all-the-icons-octicon "mail"  :face 'all-the-icons-yellow))
	       nil nil :ascent center)
	      ("observe"
	       ,(list
		 (all-the-icons-octicon "telescope"  :face 'all-the-icons-lyellow))
	       nil nil :ascent center)
	     )
	    )
      )
    #+end_src

*** COMMENT org-drill

    http://orgmode.org/worg/org-contrib/org-drill.html

    #+BEGIN_SRC emacs-lisp :tangle yes
    (require 'org-drill)
    (setq org-drill-add-random-noise-to-intervals-p t)
    (setq org-drill-leech-method 'warn)
    (setq org-drill-learn-fraction 0.3)
    #+END_SRC
     
**** Skeletons for learning swedish
      
     I learn swedish with respect to german, my native tongue.

***** Phrase
      No grammer associated. Fixed forms, etc.
      #+BEGIN_SRC emacs-lisp :tangle yes
	(define-skeleton swedish-phrase-skeleton
          "Insert swedish phrases in org-drill mode"
          ""
          "** sonst.                                                          :drill:\n"
          "   :PROPERTIES:\n"
          "   :DRILL_CARD_TYPE: hide1cloze\n"
          "   :END:\n"
          "   sv: [" (skeleton-read "svenska: ") "]\n"
          "   de: [" (skeleton-read "deutsch: ") "]\n")
      #+END_SRC

***** Verbs
      Verbs + swedish conjungation.
      #+BEGIN_SRC emacs-lisp :tangle yes
        (define-skeleton swedish-verb-skeleton
          "Insert swedish verbs in org-drill mode"
	  ""
          "** verb                                                            :drill:\n"
          "   :PROPERTIES:\n"
          "   :DRILL_CARD_TYPE: hide1cloze\n"
          "   :END:\n"
          "   sv: [" (skeleton-read "svenska: ") "]\n"
          "   de: [" (skeleton-read "deutsch: ") "]\n"
          "*** konj.\n"
          "    | infinitiv | presens | preteritum | supinum | imperativ |\n"
          "    |-----------+---------+------------+---------+-----------|\n"
          "    |    " _ "       |         |            |         |           |\n")
      #+END_SRC

****** ☛ TODO sv inifinitive can be automatically inserted in table!

***** Nouns
      Nouns + deklination
      #+BEGIN_SRC emacs-lisp :tangle yes
        (define-skeleton swedish-noun-skeleton
          "Insert swedish nouns in org-drill-mode"
          ""
          "** substantiv                                                          :drill:\n"
          "   :PROPERTIES:\n"
          "   :DRILL_CARD_TYPE: hide1cloze\n"
          "   :END:\n"
          "   sv: [" (skeleton-read "svenska: ") "]\n"
          "   de: [" (skeleton-read "deutsch: ") "]\n"
          "*** dekl.\n"
          "    | sing. obestämd | sing. bestämd | pl. obestämd | pl. bestämd |\n"
          "    |----------------+---------------+--------------+-------------|\n"
          "    |    "_"            |               |              |             |\n")
      #+END_SRC

* Packages
** Package Archives

   [[https://melpa.org][MELPA]] is the king of emacs package archives.  Follow [[https://twitter.com/melpa_emacs][MELPA on Twitter]].
    
   #+BEGIN_SRC emacs-lisp :tangle yes
     (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
   #+END_SRC
** use-package - automatically download and install packages

   We use [[https://github.com/jwiegley/use-package][=use-package=]] to automatically download and install packages,
   if they are not present on the system.  Of course, when firing up
   EMACS for the first time on a fresh system, =use-package= needs to be
   automagically installed first.

   #+BEGIN_SRC emacs-lisp :tangle yes
     (if (not (package-installed-p 'use-package))
         (progn
           (package-refresh-contents)
           (package-install 'use-package)))

     (require 'use-package)
   #+END_SRC


** List of used packages
*** org-mode related
**** org-bullets

     The following gold is from
     https://thraxys.wordpress.com/2016/01/14/pimp-up-your-org-agenda/

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package org-bullets
         :ensure t
         :init
         (setq org-bullets-bullet-list
	       '("◉" "◎" "⚫" "○" "►" "◇"))
         :config
         (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
         )
       (setq org-todo-keywords '((sequence "☛ TODO(t)" "|" "✔ DONE(d)")
       (sequence "⚑ WAITING(w)" "|")
       (sequence "|" "✘ CANCELED(c)")))
     #+END_SRC

