Knusper.el
(server-start)

(setq custom-file "~/.gnu-emacs-custom")
(load custom-file)

(setq user-full-name "Edmund Christian Herenz")

(setq TeX-auto-save t)
(setq TeX-parse-self t)
(setq-default TeX-master nil)
(setq LaTeX-math-menu-unicode t)
(add-hook 'LaTeX-mode-hook 'turn-on-auto-fill)
(require 'reftex)
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)
(setq reftex-plug-into-AUCTeX t)
(setq reftex-cite-format 'natbib)

;; use mupdf as default PDF viewer
(with-eval-after-load "tex"
  (add-to-list 'TeX-view-program-list '("mupdf" "/usr/bin/mupdf %o"))
  (setcdr (assq 'output-pdf TeX-view-program-selection) '("mupdf")))

(setq auto-mode-alist
      (cons '("\\.org$" . org-mode) auto-mode-alist))
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)
(setq org-log-done t)

(add-hook 'org-mode-hook
'(lambda ()
       (setq org-file-apps
             (append '(
                       ("\\.png\\'" . default)
                       ) org-file-apps ))))

(defun ensc/mailcap-mime-data-filter (filter)
  ""
  (mapcar (lambda(major)
        (append (list (car major))
            (remove nil
                (mapcar (lambda(minor)
      		(when (funcall filter (car major) (car minor) (cdr minor))
                    minor))
                    (cdr major)))))
mailcap-mime-data))

(defun ensc/no-pdf-doc-view-filter (major minor spec)
  (if (and (string= major "application")
 (string= minor "pdf")
 (member '(viewer . doc-view-mode) spec))
nil
    t))

(eval-after-load 'mailcap
  '(progn
     (setq mailcap-mime-data
 (ensc/mailcap-mime-data-filter 'ensc/no-pdf-doc-view-filter))))


(require 'org-drill)
(setq org-drill-add-random-noise-to-intervals-p t)
(setq org-drill-leech-method 'warn)
(setq org-drill-learn-fraction 0.3)

(define-skeleton swedish-phrase-skeleton
  "Insert swedish phrases in org-drill mode"
  ""
  "** sonst.                                                          :drill:\n"
  "   :PROPERTIES:\n"
  "   :DRILL_CARD_TYPE: hide1cloze\n"
  "   :END:\n"
  "   sv: [" (skeleton-read "svenska: ") "]\n"
  "   de: [" (skeleton-read "deutsch: ") "]\n")

(define-skeleton swedish-verb-skeleton
  "Insert swedish verbs in org-drill mode"
  ""
  "** verb                                                            :drill:\n"
  "   :PROPERTIES:\n"
  "   :DRILL_CARD_TYPE: hide1cloze\n"
  "   :END:\n"
  "   sv: [" (skeleton-read "svenska: ") "]\n"
  "   de: [" (skeleton-read "deutsch: ") "]\n"
  "*** konj.\n"
  "    | infinitiv | presens | preteritum | supinum | imperativ |\n"
  "    |-----------+---------+------------+---------+-----------|\n"
  "    |    " _ "       |         |            |         |           |\n")

(define-skeleton swedish-noun-skeleton
  "Insert swedish nouns in org-drill-mode"
  ""
  "** substantiv                                                          :drill:\n"
  "   :PROPERTIES:\n"
  "   :DRILL_CARD_TYPE: hide1cloze\n"
  "   :END:\n"
  "   sv: [" (skeleton-read "svenska: ") "]\n"
  "   de: [" (skeleton-read "deutsch: ") "]\n"
  "*** dekl.\n"
  "    | sing. obestämd | sing. bestämd | pl. obestämd | pl. bestämd |\n"
  "    |----------------+---------------+--------------+-------------|\n"
  "    |    "_"            |               |              |             |\n")

(add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)

(if (not (package-installed-p 'use-package))
    (progn
      (package-refresh-contents)
      (package-install 'use-package)))

(require 'use-package)
