Knusper.org
*** disable Shift+Arrow to select text
    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq shift-select-mode nil)
    #+END_SRC

*** middle-click pastes at point, not at mouse position
    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq mouse-yank-at-point t) 
    #+END_SRC

*** transient-mark-mode
     #+BEGIN_SRC emacs-lisp :tangle yes
      (setq transient-mark-mode t)
    #+END_SRC

*** highlight matching parenthesis based on point
    #+BEGIN_SRC emacs-lisp :tangle yes
      (show-paren-mode t)
    #+END_SRC

*** recent files mode
    #+BEGIN_SRC emacs-lisp :tangle yes
      (recentf-mode 1)
    #+END_SRC

*** Bind hippie-expand to M-<SPC> - Peace!
    #+BEGIN_SRC emacs-lisp :tangle yes
      (global-set-key "\M- " 'hippie-expand)
    #+END_SRC

*** never truncate the lines in my buffer [DISABLED]
    #+BEGIN_SRC emacs-lisp :tangle no
      (setq truncate-lines t)
    #+END_SRC

*** always truncate lines, but never the mini-buffer

    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq truncate-lines t)
      (add-hook 'minibuffer-setup-hook
	    (lambda () (setq truncate-lines nil)))
    #+END_SRC

*** Emacs close confirmation 
    (do not accidentally close emacs)

    #+BEGIN_SRC emacs-lisp :tangle yes
      (setq kill-emacs-query-functions
	    (cons (lambda () (yes-or-no-p "Really Quit Emacs? "))
		  kill-emacs-query-functions))
    #+END_SRC

*** enable disabled command - upcase region

    #+BEGIN_SRC emacs-lisp :tangle yes
      (put 'upcase-region 'disabled nil)
    #+END_SRC

*** desktop-save-mode 

    (see Sect. 42 "Saving Emacs Sessions" in Emacs
    User Manual)

    #+BEGIN_SRC emacs-lisp :tangle yes
      (desktop-save-mode 1)
      (setq desktop-restore-eager 10)
      (setq desktop-save t) ;; save without asking
    #+END_SRC

*** user ibuffer insted of list-buffers

    #+BEGIN_SRC emacs-lisp :tangle yes
      (defalias 'list-buffers 'ibuffer)
    #+END_SRC

**** adjust ibuffer column widths

     #+BEGIN_SRC emacs-lisp :tangle yes
       (setq ibuffer-formats
             '((mark modified read-only " "
                     (name 30 30 :left :elide) " "
                     (size 9 -1 :right) " "
                     (mode 16 16 :left :elide) " " filename-and-process)
               (mark " " (name 16 -1) " " filename)))
     #+END_SRC
*** eshell-stuff
    em-joc - not used anymore
    #+BEGIN_SRC emacs-lisp :tangle no
       (require 'em-joc)
        (defun eshell/info (subject)
          "Read the Info manual on SUBJECT."
          (let ((buf (current-buffer)))
            (Info-directory)
            (let ((node-exists (ignore-errors (Info-menu subject))))
              (if node-exists
                  0
      ;;          We want to switch back to *eshell* if the requested
      ;;          Info manual doesn't exist.
                (switch-to-buffer buf)
                (eshell-print (format "There is no Info manual on %s.\n"
                                      subject))
                1))))
    #+END_SRC
** Electric Pairs

   #+BEGIN_SRC emacs-lisp :tangle yes
     (electric-pair-mode 1)
     (defvar markdown-electric-pairs '((?* . ?*)) "Electric pairs for markdown-mode.")
     (defun markdown-add-electric-pairs ()
       (setq-local electric-pair-pairs (append electric-pair-pairs markdown-electric-pairs))
       (setq-local electric-pair-text-pairs electric-pair-pairs))
     (add-hook 'markdown-mode-hook 'markdown-add-electric-pairs)
   #+END_SRC

** Move around between windows (wind-move)

   Move around between windows using C-S-Arrow keys (wind-move). Better
   than pressing repeatedly C-x o. (Seems not to work in org-mode?)
    
   #+BEGIN_SRC emacs-lisp :tangle yes
     (global-set-key (kbd "<C-S-up>")     'windmove-up)
     (global-set-key (kbd "<C-S-down>")   'windmove-down)
     (global-set-key (kbd "<C-S-left>")   'windmove-left)
     (global-set-key (kbd "<C-S-right>")  'windmove-right)
   #+END_SRC

* Convenience functions not shipped in emacs
** Timestamps

   Command to insert timestamps into text - e.g.: 27.10.2015, 12:25
   Inspired from http://emacswiki.org/emacs/InsertingTodaysDate
    
   #+BEGIN_SRC emacs-lisp :tangle yes
     (defun timestamp ()
       (interactive)
       (insert (format-time-string "%d.%m.%Y, %H:%M")))
   #+END_SRC

** Count Words & Characters

   From http://ergoemacs.org/emacs/elisp_count-region.html

   #+BEGIN_SRC emacs-lisp :tangle yes
     (defun my-count-words-region (posBegin posEnd)
       "Print number of words and chars in region."
       (interactive "r")
       (message "Counting …")
       (save-excursion
         (let (wordCount charCount)
           (setq wordCount 0)
           (setq charCount (- posEnd posBegin))
           (goto-char posBegin)
           (while (and (< (point) posEnd)
                       (re-search-forward "\\w+\\W*" posEnd t))
             (setq wordCount (1+ wordCount)))

           (message "Words: %d. Chars: %d." wordCount charCount)
           )))
   #+END_SRC

** Unfill Region / Unfill Paragraph

   Source: http://ergoemacs.org/emacs/emacs_unfill-paragraph.html
    
   #+BEGIN_SRC emacs-lisp :tangle yes
     (defun unfill-paragraph ()
       "Replace newline chars in current paragraph by single spaces.
     This command does the inverse of `fill-paragraph'."
       (interactive)
       (let ((fill-column 90002000)) ; 90002000 is just random. you can use `most-positive-fixnum'
         (fill-paragraph nil)))
     (defun unfill-region (start end)
       "Replace newline chars in region by single spaces.
     This command does the inverse of `fill-region'."
       (interactive "r")
       (let ((fill-column 90002000))
         (fill-region start end)))
   #+END_SRC
    
    
    
